-- This file needs to have same structure as nvconfig.lua
-- https://github.com/NvChad/ui/blob/v3.0/lua/nvconfig.lua
-- Please read that file to know all available options :(

---@type ChadrcConfig
local M = {}

M.base46 = {
    theme = "kanagawa",
    transparency = false,
    statusline = {
        theme = "default",
    },

    hl_override = {
        Comment = { italic = true },
        ["@comment"] = { italic = true },
    },
}

M.ui = {
    tabufline = {
        enabled = false,
    },
    statusline = {
      theme = "minimal",
      separator_style = "round"

    },
    nvdash = {
        header = {
            "██████╗ ██████╗  ██████╗ ███╗   ██╗██╗ ██████╗ ███╗   ██╗",
            "██╔══██╗██╔══██╗██╔═══██╗████╗  ██║██║██╔═══██╗████╗  ██║",
            "██████╔╝██║  ██║██║   ██║██╔██╗ ██║██║██║   ██║██╔██╗ ██║",
            "██╔═══╝ ██║  ██║██║   ██║██║╚██╗██║██║██║   ██║██║╚██╗██║",
            "██║     ██████╔╝╚██████╔╝██║ ╚████║██║╚██████╔╝██║ ╚████║",
            "╚═╝     ╚═════╝  ╚═════╝ ╚═╝  ╚═══╝╚═╝ ╚═════╝ ╚═╝  ╚═══╝",
            "",
            "              🚀 P D O N I O N 🚀",
        },
        load_on_startup = true,
    },
}

return M
